app/Http/Controllers/StatisticController.php

    public function index(): View
    {
        $statistics = Statistic::with('user')
                               ->orderByDesc('total_tasks')
                               ->limit(10)
                               ->get();
---
select * from `statistics` order by `total_tasks` desc limit 10
select * from `users` where `users`.`id` in (1, 12)